; domain
(define (domain kitting-domain)
	(:requirements :strips :typing)
	(:types 
		endeffector
		endeffectorchangingstation
		endeffectorholder 
		kitinstance 
		kittray
		largeboxwithemptykittray 
		largeboxwithkit
		part 
		parttray 
		robot 
		worktable)

	(:predicates
	
	;TRUE iff eff is attached to r
	(efflocation ?eff - endeffector ?r - robot)	
		
	;TRUE iff eff is in effh		
	(efflocation ?eff - endeffector ?effh - endeffectorholder)

	;TRUE iff r is equipped with eff
	(r-with-eff ?r - robot ?eff - endeffector)				
		
	;TRUE iff r is not equipped with any end effector
	(r-no-eff ?r - robot)						
		
	;TRUE iff kins is on wtable		
	(onworktable ?wtable - worktable ?kins - kitinstance)
		
	;TRUE iff kt is on wtable
	(onworktable ?wtable - worktable ?kt - kittray)	
	
	;TRUE iff there is nothing on wtable
	(worktable-empty ?wtable - worktable)
	
	;TRUE iff kins is in lbwk
	(kinslocation ?kins - kitinstance ?lbwk - largeboxwithkit)		
	
	;TRUE iff kins is on wtable
	(kinslocation ?kins - kitinstance ?wtable - worktable)	
	
	;TRUE iff kins is being held by r
	(kinslocation ?kins - kitinstance ?r - robot)				
	
	;TRUE iff kt is in lbwekt				
	(ktlocation ?kt - kittray ?lbwekt - largeboxwithemptykittray)	

	;TRUE iff kt is being held by r
	(ktlocation ?kt - kittray ?r - robot)					
		
	;TRUE iff kt is on wtable
	(ktlocation ?kt - kittray ?wtable - worktable)
	
	;TRUE iff p is in pt
	(partlocation ?p - part ?pt - parttray)					
	
	;TRUE iff p is in kins
	(partlocation ?p - part ?kins - kitinstance)			
		
	;TRUE iff p is being held by r
	(partlocation ?p - part ?r - robot)	

	;TRUE iff r is holding kt						
	(rhold ?r - robot ?kt - kittray)	

	;TRUE iff r is holding kins					
	(rhold ?r - robot ?kins - kitinstance)				
		
	;TRUE iff r is holding p
	(rhold ?r - robot ?p - part)					
			
	;TRUE iff r is not holding anything
	(rhold-empty ?r - robot)							
			
	;TRUE iff lbwk is not full
	(lbwk-non-full ?lbwk - largeboxwithkit)
		
	;TRUE iff lbwekt is not empty
	(lbwekt-non-empty ?lbwekt - largeboxwithemptykittray)	
	
	;TRUE iff pt is empty		
	(part-tray-non-empty ?pt - parttray)
	
	;TRUE iff eff is for kt						
	(efftype - endeffector ?kt - kittray)
	
	;TRUE iff eff is holding kins			
	(efftype ?eff - endeffector ?kins - kitinstance)	
	
	;TRUE iff eff is holding p
	(efftype ?eff - endeffector ?p - part)

	;TRUE iff effh is holding eff				
	(effhhold-eff ?effh - endeffectorholder ?eff - endeffector)			
    )
   
	(:action take-kt
		:parameters(
			?r - robot 
			?kt - kittray 
			?lbwekt - largeboxwithemptykittray 
			?eff - endeffector 
			?wtable - worktable)
		:precondition(and 
			(rhold-empty ?r) 
			(lbwekt-non-empty ?lbwekt)
			(r-with-eff ?r ?eff) 
			(ktlocation ?kt ?lbwekt) 
			(efflocation ?eff ?r)
			(worktable-empty ?wtable)
			(efftype ?eff ?kt))
		:effect(and 
			(rhold ?r ?kt) 
			(ktlocation ?kt ?r) 
			(not (rhold-empty ?r)) 
			(not (ktlocation ?kt ?lbwekt))))
			
	(:action put-kt
		:parameters(
			?r - robot 
			?kt - kittray 
			?wtable - worktable)
		:precondition 
			(and  
			(ktlocation ?kt ?r) 
			(rhold ?r ?kt) 
			(worktable-empty ?wtable))
		:effect(and 
			(not(ktlocation ?kt ?r)) 
			(not(rhold ?r ?kt)) 
			(not(worktable-empty ?wtable)) 
			(ktlocation ?kt ?wtable) 
			(rhold-empty ?r) 
			(onworktable ?wtable ?kt))
	)

	(:action take-kins
		:parameters(
			?r - robot 
			?kins - kitinstance 
			?wtable - worktable 
			?eff - endeffector)
		:precondition 
			(and  
			(kinslocation ?kins ?wtable) 
			(rhold-empty ?r) 
			(onworktable ?wtable ?kins) 
			(r-with-eff ?r ?eff)
			(efftype ?eff ?kins))
		:effect 
			(and 
			(kinslocation ?kins ?r) 
			(rhold ?r ?kins) 
			(worktable-empty ?wtable) 
			(not (kinslocation ?kins ?wtable)) 
			(not (rhold-empty ?r))
			(not(onworktable ?wtable ?kins)))
	)
			
	(:action put-kins
		:parameters(
			?r - robot 
			?kins - kitinstance 
			?lbwk - largeboxwithkit)
		
		:precondition 
			(and  
			(kinslocation ?kins ?r) 
			(rhold ?r ?kins) 
			(lbwk-non-full ?lbwk))
		:effect 
			(and  
			(kinslocation ?kins ?lbwk) 
			(rhold-empty ?r)
			(not (kinslocation ?kins ?r))
			(not (rhold ?r ?kins)))
	)
			
	(:action take-part
		:parameters(
			?r - robot 
			?part - part 
			?pt - parttray 
			?eff - endeffector 
			?wtable - worktable 
			?kins - kitinstance)
		:precondition 
			(and  
			(partlocation ?part ?pt) 
			(efflocation ?eff ?r) 
			(rhold-empty ?r) 
			(r-with-eff ?r ?eff) 
			(onworktable ?wtable ?kins) 
			(kinslocation ?kins ?wtable)
			(efftype ?eff ?part)
			(part-tray-non-empty ?pt))
		:effect 
			(and  
			(partlocation ?part ?r) 
			(rhold ?r ?part)
			(not (partlocation ?part ?pt))
			(not (rhold-empty ?r)))
	)
			
	(:action put-part
		:parameters(
			?r - robot 
			?p - part 
			?kins - kitinstance  
			?wtable - worktable)
		:precondition 
			(and  
			(partlocation ?p ?r) 
			(rhold ?r ?p) 
			(onworktable ?wtable ?kins)
			(kinslocation ?kins ?wtable))
		:effect 
			(and  
			(not (partlocation ?p ?r))
			(not (rhold ?r ?p))
			(partlocation ?p ?kins) 
			(rhold-empty ?r))
	)
			
	(:action attach-eff
		:parameters(
			?r - robot 
			?eff - endeffector 
			?effh - endeffectorholder)
		:precondition 
			(and  
			(efflocation ?eff ?effh) 
			(r-no-eff ?r)
			(effhhold-eff  ?effh ?eff)
			)
		:effect 
			(and  
			(rhold-empty ?r)
			(efflocation ?eff ?r) 
			(r-with-eff ?r ?eff)
			(not (efflocation ?eff ?effh)) 
			(not (effhhold-eff  ?effh ?eff))
			(not (r-no-eff ?r)))
	)
	
	(:action remove-eff
		:parameters(
			?r - robot 
			?eff - endeffector 
			?effh - endeffectorholder)
		:precondition 
			(and  
			(efflocation ?eff ?r) 
			(r-with-eff ?r ?eff) 
			(rhold-empty ?r))
		:effect 
			(and
			(not(efflocation ?eff ?r))
			(not(r-with-eff ?r ?eff))
			(efflocation ?eff ?effh)
			(effhhold-eff  ?effh ?eff)
			(r-no-eff ?r) 
			)
	)
			
	(:action create-kins
		:parameters(
			?kins - kitinstance 
			?kt - kittray 
			?wtable - worktable)
		:precondition 
			(onworktable ?wtable ?kt)
		:effect 
			(and 
			(not(onworktable ?wtable ?kt)) 
			(onworktable ?wtable ?kins) 
			(kinslocation ?kins ?wtable))
	)

	;(:action switch-eff	
	;	:parameters(
	;		?r - robot 
	;		?effold ?effnew - endeffector
	;		?effhold ?effhnew - endeffectorholder
	;			)
	;	:precondition 
	;		(and  
	;		(effector-in-effholder ?effnew ?effhnew) 
	;		(efflocation ?effold ?r) 
	;		(robot-with-eff ?r ?effold)
	;		(rhold-empty ?r))
	;	:effect 
	;		(and  
	;		(efflocation ?effnew ?r) 
	;		(robot-with-eff ?r ?effnew)
	;		(not (effector-in-effholder ?effnew ?effhnew))
	;		(not (efflocation ?effold ?r))
	;		(not (robot-with-eff ?r ?effold)))
	;)
)

; problem
(define (problem kitting-problem)
	(:domain kitting-domain)
	(:objects
		r1 - robot
		kt1 - kittray
		kins1 - kitinstance
		lbwekt1 - largeboxwithemptykittray
		lbwk1 - largeboxwithkit 
		wtable - worktable
		ptA ptB ptC - parttray
		partA1 partA2 partB partC - part 
		eff1 eff2 - endeffector
		effh1 effh2 - endeffectorholder
	)


	(:init
		(r-no-eff r1)
		(lbwekt-non-empty lbwekt1)
		(lbwk-non-full lbwk1)
		(part-tray-non-empty ptA)
		(part-tray-non-empty ptB) 
		(part-tray-non-empty ptC)
		(efflocation eff1 effh1)
		(efflocation eff2 effh2) 
		(effhhold-eff effh1 eff1)
		(effhhold-eff effh2 eff2)
		(worktable-empty wtable) 
		(partlocation partA1 ptA)
		(partlocation partA2 ptA) 
		(partlocation partB ptB)
		(partlocation partC ptC) 
		(ktlocation kt1 lbwekt1)
		(efftype eff1 partA1)
		(efftype eff1 partA2)
		(efftype eff1 partB)
		(efftype eff1 partC)
		(efftype eff2 kt1)
		(efftype eff2 kins1)
	)
	
	
	(:goal
	  (and  
	    (partlocation partA1 kins1) 
	    (partlocation partA2 kins1) 
	    (partlocation partB kins1) 
	    (partlocation partC kins1) 
	    (kinslocation kins1 lbwk1)
	   )
	)

	;(:goal
	;(and
	;(onworktable-kins wtable kins1) 
	;(partlocation-kins partA1 kins1)
	;)
	;)
)

; plan
1. (attach-eff r1 eff2 effh2)
   deleted: (efflocation eff2 effh2) (effhhold-eff effh2 eff2) (r-no-eff r1)
   added: (rhold-empty r1) (efflocation eff2 r1) (r-with-eff r1 eff2)
   goals met: 0 of 5
2. (take-kt r1 kt1 lbwekt1 eff2 wtable)
   deleted: (rhold-empty r1) (ktlocation kt1 lbwekt1)
   added: (rhold r1 kt1) (ktlocation kt1 r1)
   goals met: 0 of 5
3. (put-kt r1 kt1 wtable)
   deleted: (ktlocation kt1 r1) (rhold r1 kt1) (worktable-empty wtable)
   added: (ktlocation kt1 wtable) (rhold-empty r1) (onworktable wtable kt1)
   goals met: 0 of 5
4. (create-kins kins1 kt1 wtable)
   deleted: (onworktable wtable kt1)
   added: (onworktable wtable kins1) (kinslocation kins1 wtable)
   goals met: 0 of 5
5. (remove-eff r1 eff2 effh1)
   deleted: (efflocation eff2 r1) (r-with-eff r1 eff2)
   added: (efflocation eff2 effh1) (effhhold-eff effh1 eff2) (r-no-eff r1)
   goals met: 0 of 5
6. (attach-eff r1 eff1 effh1)
   deleted: (efflocation eff1 effh1) (effhhold-eff effh1 eff1) (r-no-eff r1)
   added: (efflocation eff1 r1) (r-with-eff r1 eff1)
   goals met: 0 of 5
7. (take-part r1 partc ptc eff1 wtable kins1)
   deleted: (partlocation partc ptc) (rhold-empty r1)
   added: (partlocation partc r1) (rhold r1 partc)
   goals met: 0 of 5
8. (put-part r1 partc kins1 wtable)
   deleted: (partlocation partc r1) (rhold r1 partc)
   added: (partlocation partc kins1) (rhold-empty r1)
   goals met: 1 of 5
9. (take-part r1 parta1 pta eff1 wtable kins1)
   deleted: (partlocation parta1 pta) (rhold-empty r1)
   added: (partlocation parta1 r1) (rhold r1 parta1)
   goals met: 1 of 5
10. (put-part r1 parta1 kins1 wtable)
   deleted: (partlocation parta1 r1) (rhold r1 parta1)
   added: (partlocation parta1 kins1) (rhold-empty r1)
   goals met: 2 of 5
11. (take-part r1 partb ptb eff1 wtable kins1)
   deleted: (partlocation partb ptb) (rhold-empty r1)
   added: (partlocation partb r1) (rhold r1 partb)
   goals met: 2 of 5
12. (put-part r1 partb kins1 wtable)
   deleted: (partlocation partb r1) (rhold r1 partb)
   added: (partlocation partb kins1) (rhold-empty r1)
   goals met: 3 of 5
13. (take-part r1 parta2 pta eff1 wtable kins1)
   deleted: (partlocation parta2 pta) (rhold-empty r1)
   added: (partlocation parta2 r1) (rhold r1 parta2)
   goals met: 3 of 5
14. (put-part r1 parta2 kins1 wtable)
   deleted: (partlocation parta2 r1) (rhold r1 parta2)
   added: (partlocation parta2 kins1) (rhold-empty r1)
   goals met: 4 of 5
15. (remove-eff r1 eff1 effh2)
   deleted: (efflocation eff1 r1) (r-with-eff r1 eff1)
   added: (efflocation eff1 effh2) (effhhold-eff effh2 eff1) (r-no-eff r1)
   goals met: 4 of 5
16. (attach-eff r1 eff2 effh1)
   deleted: (efflocation eff2 effh1) (effhhold-eff effh1 eff2) (r-no-eff r1)
   added: (efflocation eff2 r1) (r-with-eff r1 eff2)
   goals met: 4 of 5
17. (take-kins r1 kins1 wtable eff2)
   deleted: (kinslocation kins1 wtable) (rhold-empty r1) (onworktable wtable kins1)
   added: (kinslocation kins1 r1) (rhold r1 kins1) (worktable-empty wtable)
   goals met: 4 of 5
18. (put-kins r1 kins1 lbwk1)
   deleted: (kinslocation kins1 r1) (rhold r1 kins1)
   added: (kinslocation kins1 lbwk1) (rhold-empty r1)
   goals met: 5 of 5
